results/exp1/20260224T024240Z-vanilla-katran/raw/wrk/c16/run-3.txt
Running 1m test @ http://192.168.100.100:8080/exp1-1k.txt
  4 threads and 16 connections
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency    93.36us   20.70us   1.98ms   69.52%
    Req/Sec    42.21k     3.08k   49.19k    68.72%
  Latency Distribution
     50%   94.00us
     75%  105.00us
     90%  117.00us
     99%  153.00us
  10096574 requests in 1.00m, 11.97GB read
Requests/sec: 167998.29
Transfer/sec:    203.95MB